<a href="https://colab.research.google.com/github/KrishnaGande/Ineuron-Learning/blob/main/Pandas_2_data_manipulation_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States']="CA NV AZ".split()
df.set_index('States',inplace=True)
print(df)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [ ]:
df.dropna(thresh=2,axis=1)

          A  C
States
CA      1.0  1
NV      2.0  2
AZ      NaN  3

In [ ]:
print("\nDropping any rows with a NaN value\n",'-'*35, sep='')
print(df.dropna(axis=0))

Dropping any rows with a NaN value
-----------------------------------
          A    B  C
States
CA      1.0  5.0  1

In [ ]:
print("\nDropping any column with a NaN value\n",'-'*35, sep='')
print(df.dropna(axis=1))

Dropping any column with a NaN value
-----------------------------------
        C
States
CA      1
NV      2
AZ      3

In [ ]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [ ]:
print("\nDropping a row with a minimum 2 NaN value using 'thresh' parameter\n",'-'*68, sep='')
print(df.dropna(axis=0, thresh=4))

Dropping a row with a minimum 2 NaN value using 'thresh' parameter
--------------------------------------------------------------------
Empty DataFrame
Columns: [A, B, C]
Index: []

In [ ]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [ ]:
df.fillna(1)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.0  2
AZ      1.0  1.0  3

In [ ]:
print("\nFilling values with a default value\n",'-'*35, sep='')
print(df.fillna(value='FILL VALUE'))

Filling values with a default value
-----------------------------------
                 A           B  C
States
CA               1           5  1
NV               2  FILL VALUE  2
AZ      FILL VALUE  FILL VALUE  3

In [ ]:
print("\nFilling values with a computed value (mean of column A here)\n",'-'*60, sep='')
print(df.fillna(value=df['A'].mean()))

Filling values with a computed value (mean of column A here)
------------------------------------------------------------
          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3

In [ ]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
byComp = df.groupby('Company')
print("\nGrouping by 'Company' column and listing mean sales\n",'-'*55, sep='')
print(byComp.mean())

Grouping by 'Company' column and listing mean sales
-------------------------------------------------------
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
byComp.describe()['Sales'].loc[['GOOG','MSFT'],['mean','std']]

          mean         std
Company
GOOG     160.0   56.568542
MSFT     232.0  152.735065

In [ ]:
df.groupby('Company').describe().loc['GOOG']['Sales'][['mean','std']]

mean    160.000000
std      56.568542
Name: GOOG, dtype: float64

In [ ]:
d=(df.groupby('Company').describe())
df1=d.T
df1

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
df1.loc['Sales'].loc[['std'],['GOOG']]

Company       GOOG
std      56.568542

In [ ]:
 print("\nGrouping by 'Company' column and listing sum of sales\n",'-'*55, sep='')
print(byComp.sum())

Grouping by 'Company' column and listing sum of sales
-------------------------------------------------------
         Sales
Company
FB         593
GOOG       320
MSFT       464

In [ ]:
print("\nAll in one line of command (Stats for 'FB')\n",'-'*65, sep='')
print(pd.DataFrame(df.groupby('Company').describe().loc['FB']).transpose())

All in one line of command (Stats for 'FB')
-----------------------------------------------------------------
   Sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [ ]:
(pd.DataFrame(df.groupby('Company').describe().loc['FB'])).transpose()

   Sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [ ]:
(pd.DataFrame(df.groupby('Company').describe().loc['FB'])).transpose()

   Sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [ ]:
print("\nSame type of extraction with little different command\n",'-'*68, sep='')
print(df.groupby('Company').describe().loc[['GOOG', 'MSFT']])

Same type of extraction with little different command
--------------------------------------------------------------------
        Sales
        count   mean         std    min    25%    50%    75%    max
Company
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

In [ ]:
# Merging two data frames
# Creating data frames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[0,1,2,3])

In [ ]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])

In [ ]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
print("\nThe DataFrame number 1\n",'-'*30, sep='')
print(df1)

The DataFrame number 1
------------------------------
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
print("\nThe DataFrame number 2\n",'-'*30, sep='')
print(df2)

The DataFrame number 2
------------------------------
    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [ ]:
print("\nThe DataFrame number 3\n",'-'*30, sep='')
print(df3)

The DataFrame number 3
------------------------------
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
#concatenation
df_cat1 = pd.concat([df1,df2,df3], axis=1)
print("\nAfter concatenation along row\n",'-'*30, sep='')
print(df_cat1)
#df_cat1.iloc[2:6,1]

After concatenation along row
------------------------------
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   A4   B4   C4   D4  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   A5   B5   C5   D5  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   A6   B6   C6   D6  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
df_cat1.iloc[4]

A    NaN
B    NaN
C    NaN
D    NaN
A    NaN
B    NaN
C    NaN
D    NaN
A     A8
B     B8
C     C8
D     D8
Name: 8, dtype: object

In [ ]:
df_cat2 = pd.concat([df1,df2,df3], axis=1)
print("\nAfter concatenation along column\n",'-'*60, sep='')
print(df_cat2)

After concatenation along column
------------------------------------------------------------
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   A4   B4   C4   D4  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   A5   B5   C5   D5  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   A6   B6   C6   D6  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
df_cat2.fillna(value=0, inplace=True)
print("\nAfter filling missing values with zero\n",'-'*60, sep='')
print(df_cat2)

After filling missing values with zero
------------------------------------------------------------
     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0  A4  B4  C4  D4    0    0    0    0
1   A1  B1  C1  D1  A5  B5  C5  D5    0    0    0    0
2   A2  B2  C2  D2  A6  B6  C6  D6    0    0    0    0
3   A3  B3  C3  D3  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

In [ ]:
# merging by a common key

In [ ]:
df1 = pd.DataFrame({'key1': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                    'C': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df2 = pd.DataFrame({'key2': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
df1

  key1   A   C   B
0   K0  A0  A0  B0
1   K8  A1  A1  B1
2   K2  A2  A2  B2
3   K3  A3  A3  B3

In [ ]:
df2

  key2   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [ ]:
print("\nThe DataFrame 'df1'\n",'-'*30, sep='')
print(df1)

The DataFrame 'df1'
------------------------------
  key1   A   C   B
0   K0  A0  A0  B0
1   K8  A1  A1  B1
2   K2  A2  A2  B2
3   K3  A3  A3  B3

In [ ]:
print("\nThe DataFrame 'df2'\n",'-'*30, sep='')
print(df2)

The DataFrame 'df2'
------------------------------
  key2   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [ ]:
merge1= pd.merge(df1,df2,how='left',left_on='key1',right_on='key2')
print("\nAfter simple merging with 'inner' method\n",'-'*50, sep='')
print(merge1)

After simple merging with 'inner' method
--------------------------------------------------
  key1   A C_x   B key2  C_y    D
0   K0  A0  A0  B0   K0   C0   D0
1   K8  A1  A1  B1  NaN  NaN  NaN
2   K2  A2  A2  B2   K2   C2   D2
3   K3  A3  A3  B3   K3   C3   D3

In [ ]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [ ]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
pd.merge(left, right, how='left',on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [ ]:
pd.merge(left, right, how='right',on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [ ]:
#join operators
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
df1 = pd.DataFrame({'key1': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                    'C': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df2 = pd.DataFrame({'key2': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})
df3 = pd.DataFrame({'key3': ['K0', 'K3', 'K4', 'K5'],
                          'E': ['C0', 'C1', 'C2', 'C3'],
                          'F': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
pd.concat([df1,df2,df3],axis=1)

  key1   A   C   B key2   C   D key3   E   F
0   K0  A0  A0  B0   K0  C0  D0   K0  C0  D0
1   K8  A1  A1  B1   K1  C1  D1   K3  C1  D1
2   K2  A2  A2  B2   K2  C2  D2   K4  C2  D2
3   K3  A3  A3  B3   K3  C3  D3   K5  C3  D3

In [ ]:
pd.merge(a,df3,how='outer')

  key1    A    C    B key3    E    F
0   K0   A0   A0   B0   K0   C0   D0
1   K8   A1   A1   B1  NaN  NaN  NaN
2   K2   A2   A2   B2  NaN  NaN  NaN
3   K3   A3   A3   B3   K3   C1   D1
4  NaN  NaN  NaN  NaN   K4   C2   D2
5  NaN  NaN  NaN  NaN   K5   C3   D3

In [ ]:
a=pd.merge(df1,df2,how='outer',left_on='key1',right_on='key2')
a

  key1    A  C_x    B key2  C_y    D
0   K0   A0   A0   B0   K0   C0   D0
1   K8   A1   A1   B1  NaN  NaN  NaN
2   K2   A2   A2   B2   K2   C2   D2
3   K3   A3   A3   B3   K3   C3   D3
4  NaN  NaN  NaN  NaN   K1   C1   D1

In [ ]:
# use of apply functions

In [ ]:
# Define a function
def testfunc(x):
    if (x> 500):
        return (10*np.log10(x))
    else:
        return (x/10)

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   'col2':[444,555,666,444,333,222,666,777,666,555],
                   'col3':'aaa bb c dd eeee fff gg h iii j'.split()})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [ ]:
df['col20']=df['col2'].apply(testfunc)

In [ ]:
df

   col1  col2  col3  col10      col20
0     1   444   aaa     10  44.400000
1     2   555    bb     20  27.442930
2     3   666     c     30  28.234742
3     4   444    dd     40  44.400000
4     5   333  eeee     50  33.300000
5     6   222   fff     60  22.200000
6     7   666    gg     70  28.234742
7     8   777     h     80  28.904210
8     9   666   iii     90  28.234742
9    10   555     j    100  27.442930

In [ ]:
df['col10']=df['col1']*10

   col1  col2  col3  col10
0     1   444   aaa     10
1     2   555    bb     20
2     3   666     c     30
3     4   444    dd     40
4     5   333  eeee     50
5     6   222   fff     60
6     7   666    gg     70
7     8   777     h     80
8     9   666   iii     90
9    10   555     j    100

In [ ]:
df['FuncApplied'] = df['col2'].apply(lambda x : np.log(x))
print(df)

   col1  col2  col3  col10      col20  FuncApplied
0     1   444   aaa     10  44.400000     6.095825
1     2   555    bb     20  27.442930     6.318968
2     3   666     c     30  28.234742     6.501290
3     4   444    dd     40  44.400000     6.095825
4     5   333  eeee     50  33.300000     5.808142
5     6   222   fff     60  22.200000     5.402677
6     7   666    gg     70  28.234742     6.501290
7     8   777     h     80  28.904210     6.655440
8     9   666   iii     90  28.234742     6.501290
9    10   555     j    100  27.442930     6.318968

In [ ]:
df['col3length']= df['col3'].apply(len)
print(df)

   col1  col2  col3  col10      col20  FuncApplied  col3length
0     1   444   aaa     10  44.400000     6.095825           3
1     2   555    bb     20  27.442930     6.318968           2
2     3   666     c     30  28.234742     6.501290           1
3     4   444    dd     40  44.400000     6.095825           2
4     5   333  eeee     50  33.300000     5.808142           4
5     6   222   fff     60  22.200000     5.402677           3
6     7   666    gg     70  28.234742     6.501290           2
7     8   777     h     80  28.904210     6.655440           1
8     9   666   iii     90  28.234742     6.501290           3
9    10   555     j    100  27.442930     6.318968           1

In [ ]:
df['FuncApplied'].apply(lambda x: np.sqrt(x))

0    2.468972
1    2.513756
2    2.549763
3    2.468972
4    2.410009
5    2.324366
6    2.549763
7    2.579814
8    2.549763
9    2.513756
Name: FuncApplied, dtype: float64

In [ ]:
print("\nSum of the column 'FuncApplied' is: ",df['FuncApplied'].sum())

Sum of the column 'FuncApplied' is:  62.19971458619886

In [ ]:
print("Mean of the column 'FuncApplied' is: ",df['FuncApplied'].mean())

Mean of the column 'FuncApplied' is:  6.219971458619886

In [ ]:
print("Std dev of the column 'FuncApplied' is: ",df['FuncApplied'].std())

Std dev of the column 'FuncApplied' is:  0.3822522801574853

In [ ]:
print("Min and max of the column 'FuncApplied' are: ",df['FuncApplied'].min(),"and",df['FuncApplied'].max())

Min and max of the column 'FuncApplied' are:  5.402677381872279 and 6.655440350367647

In [ ]:
### Deletion, sorting, list of column and row names

In [ ]:
print("\nName of columns\n",'-'*20, sep='')
print(df.columns)

Name of columns
--------------------
Index(['col1', 'col2', 'col3', 'col10', 'col20', 'FuncApplied', 'col3length'], dtype='object')

In [ ]:
l = list(df.columns)
print("\nColumn names in a list of strings for later manipulation:",l)

Column names in a list of strings for later manipulation: ['col1', 'col2', 'col3', 'col10', 'col20', 'FuncApplied', 'col3length']

In [ ]:
print("\nDeleting last column by 'del' command\n",'-'*50, sep='')
del df['col3length']
print(df)
df['col3length']= df['col3'].apply(len)

Deleting last column by 'del' command
--------------------------------------------------
   col1  col2  col3  col10      col20  FuncApplied
0     1   444   aaa     10  44.400000     6.095825
1     2   555    bb     20  27.442930     6.318968
2     3   666     c     30  28.234742     6.501290
3     4   444    dd     40  44.400000     6.095825
4     5   333  eeee     50  33.300000     5.808142
5     6   222   fff     60  22.200000     5.402677
6     7   666    gg     70  28.234742     6.501290
7     8   777     h     80  28.904210     6.655440
8     9   666   iii     90  28.234742     6.501290
9    10   555     j    100  27.442930     6.318968

In [ ]:
df.sort_values(by='col2') #inplace=False by default

   col1  col2  col3  col10      col20  FuncApplied  col3length
5     6   222   fff     60  22.200000     5.402677           3
4     5   333  eeee     50  33.300000     5.808142           4
0     1   444   aaa     10  44.400000     6.095825           3
3     4   444    dd     40  44.400000     6.095825           2
1     2   555    bb     20  27.442930     6.318968           2
9    10   555     j    100  27.442930     6.318968           1
2     3   666     c     30  28.234742     6.501290           1
6     7   666    gg     70  28.234742     6.501290           2
8     9   666   iii     90  28.234742     6.501290           3
7     8   777     h     80  28.904210     6.655440           1

In [ ]:
df.sort_values(by='FuncApplied',ascending=False) #inplace=False by default

   col1  col2  col3  col10      col20  FuncApplied  col3length
7     8   777     h     80  28.904210     6.655440           1
2     3   666     c     30  28.234742     6.501290           1
6     7   666    gg     70  28.234742     6.501290           2
8     9   666   iii     90  28.234742     6.501290           3
1     2   555    bb     20  27.442930     6.318968           2
9    10   555     j    100  27.442930     6.318968           1
0     1   444   aaa     10  44.400000     6.095825           3
3     4   444    dd     40  44.400000     6.095825           2
4     5   333  eeee     50  33.300000     5.808142           4
5     6   222   fff     60  22.200000     5.402677           3

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[None,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [ ]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [ ]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [ ]:
df1

  key1   A   C   B
0   K0  A0  A0  B0
1   K8  A1  A1  B1
2   K2  A2  A2  B2
3   K3  A3  A3  B3

In [ ]:
df2

  key2   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [ ]:
df3

  key3   E   F
0   K0  C0  D0
1   K3  C1  D1
2   K4  C2  D2
3   K5  C3  D3

In [ ]:
pd.merge(df1, df2, how='inner')

Empty DataFrame
Columns: [key1, A, C, B, key2, D]
Index: []

In [ ]:
pd.merge(df1, df2, how='outer')

  key1    A   C    B key2    D
0   K0   A0  A0   B0  NaN  NaN
1   K8   A1  A1   B1  NaN  NaN
2   K2   A2  A2   B2  NaN  NaN
3   K3   A3  A3   B3  NaN  NaN
4  NaN  NaN  C0  NaN   K0   D0
5  NaN  NaN  C1  NaN   K1   D1
6  NaN  NaN  C2  NaN   K2   D2
7  NaN  NaN  C3  NaN   K3   D3

In [ ]:
pd.merge(df1, df2, how='left')

  key1   A   C   B key2    D
0   K0  A0  A0  B0  NaN  NaN
1   K8  A1  A1  B1  NaN  NaN
2   K2  A2  A2  B2  NaN  NaN
3   K3  A3  A3  B3  NaN  NaN

In [ ]:
pd.merge(df1, df2, how='right')

  key1    A   C    B key2   D
0  NaN  NaN  C0  NaN   K0  D0
1  NaN  NaN  C1  NaN   K1  D1
2  NaN  NaN  C2  NaN   K2  D2
3  NaN  NaN  C3  NaN   K3  D3

In [ ]:
df5=pd.read_csv('https://raw.githubusercontent.com/PramodShenoy/911-Calls/master/911.csv')

In [ ]:
df5

             lat        lng  ...                            addr  e
0      40.297876 -75.581294  ...          REINDEER CT & DEAD END  1
1      40.258061 -75.264680  ...      BRIAR PATH & WHITEMARSH LN  1
2      40.121182 -75.351975  ...                        HAWS AVE  1
3      40.116153 -75.343513  ...              AIRY ST & SWEDE ST  1
4      40.251492 -75.603350  ...        CHERRYWOOD CT & DEAD END  1
...          ...        ...  ...                             ... ..
99487  40.132869 -75.333515  ...         MARKLEY ST & W LOGAN ST  1
99488  40.006974 -75.289080  ...  LANCASTER AVE & RITTENHOUSE PL  1
99489  40.115429 -75.334679  ...         CHESTNUT ST & WALNUT ST  1
99490  40.186431 -75.192555  ...           WELSH RD & WEBSTER LN  1
99491  40.207055 -75.317952  ...          MORRIS RD & S BROAD ST  1

[99492 rows x 9 columns]

In [ ]:
df5.describe()

                lat           lng           zip        e
count  99492.000000  99492.000000  86637.000000  99492.0
mean      40.159526    -75.317464  19237.658298      1.0
std        0.094446      0.174826    345.344914      0.0
min       30.333596    -95.595595  17752.000000      1.0
25%       40.100423    -75.392104  19038.000000      1.0
50%       40.145223    -75.304667  19401.000000      1.0
75%       40.229008    -75.212513  19446.000000      1.0
max       41.167156    -74.995041  77316.000000      1.0

In [ ]:
a = df5.dtypes[df5.dtypes == "object"].index
a
df5[a].describe()

                                                     desc  ...                               addr
count                                               99492  ...                              98973
unique                                              99455  ...                              21914
top     GREEN ST & E BASIN ST;  NORRISTOWN; Station 30...  ...  SHANNONDELL DR & SHANNONDELL BLVD
freq                                                    4  ...                                938

[4 rows x 5 columns]

In [ ]:
df5['lat']=df5['lat'].astype('int64')

In [ ]:
df5['lng']=df5['lng'].astype('int64')

In [ ]:
dfsamp=df5.groupby('lat')

In [ ]:
dfsamp.count()

       lng   desc    zip  title  timeStamp    twp   addr      e
lat
30       1      1      1      1          1      1      1      1
32       1      1      1      1          1      1      1      1
39    1477   1477   1415   1477       1477   1477   1475   1477
40   98012  98012  85219  98012      98012  97970  97495  98012
41       1      1      1      1          1      0      1      1

In [ ]:
dfsamp1=df5.groupby('zip')

In [ ]:
dfsamp1.count()

         lat  lng  desc  title  timeStamp  twp  addr    e
zip
17752.0    1    1     1      1          1    0     1    1
18036.0    2    2     2      2          2    2     2    2
18041.0  414  414   414    414        414  414   414  414
18054.0  326  326   326    326        326  326   325  326
18056.0    6    6     6      6          6    6     6    6
...      ...  ...   ...    ...        ...  ...   ...  ...
19512.0  220  220   220    220        220  220   220  220
19518.0   57   57    57     57         57   57    57   57
19525.0  965  965   965    965        965  965   961  965
36107.0    1    1     1      1          1    1     1    1
77316.0    1    1     1      1          1    1     1    1

[104 rows x 8 columns]

In [ ]:
type(df5['timeStamp'])

pandas.core.series.Series

In [ ]:
my_timestamp=df5['timeStamp']

In [ ]:
my_timestamp

'2015-12-10 17:40:01'

In [ ]:
from datetime import datetime as dt
df5['timeStamp']=df5['timeStamp'].apply(lambda x: pd.to_datetime(str(x)))

In [ ]:
df5['day']=df5['timeStamp'].dt.day_name()

In [ ]:
df5

       lat  lng  ...        date        day
0       40  -75  ...  2015-12-10   Thursday
1       40  -75  ...  2015-12-10   Thursday
2       40  -75  ...  2015-12-10   Thursday
3       40  -75  ...  2015-12-10   Thursday
4       40  -75  ...  2015-12-10   Thursday
...    ...  ...  ...         ...        ...
99487   40  -75  ...  2016-08-24  Wednesday
99488   40  -75  ...  2016-08-24  Wednesday
99489   40  -75  ...  2016-08-24  Wednesday
99490   40  -75  ...  2016-08-24  Wednesday
99491   40  -75  ...  2016-08-24  Wednesday

[99492 rows x 11 columns]

In [ ]:
 count=0
for i in range(0,len(df5)):
  if df5.iloc[i].twp == 'NORRISTOWN':
    count=count+1
print(count)

5890